In [1]:
import pandas as pd

In [4]:
print ('hello')

hello

In [1]:
print 'hello'

hello

In [1]:
a = 5; b = 7
c = 8; d = 4
if a < b ^ c > d:
    print('Made it')

Made it

In [8]:
a = 5; b = 7
c = 8; d = 4
if (a < b) | (c > d):
    print('Made it')

Made it

In [9]:
a = 5; b = 7
c = 8; d = 4
if (a < b) & (c > d):
    print('Made it')

Made it

In [10]:
for i in range(4):
    for j in range(4):
        if j > i:
            break
        print((i, j))

(0, 0)
(1, 0)
(1, 1)
(2, 0)
(2, 1)
(2, 2)
(3, 0)
(3, 1)
(3, 2)
(3, 3)

In [11]:
for i in range(4):
    print(i)

0
1
2
3

In [12]:
range(4)

range(0, 4)

In [1]:
import pandas as pd
import numpy as np
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj
obj['b']
obj[1]
obj[2:4]
obj[['b', 'a', 'd']]
obj[[1, 3]]
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [16]:
xlist= [1,2,3,4]

In [17]:
xlist

[1, 2, 3, 4]

In [19]:
for x in xlist:
    print (x)

1
2
3
4

In [20]:
xdict = {'x':1, 'y':2}

In [21]:
xdict

{'x': 1, 'y': 2}

In [22]:
list(range(1, 20, 2))

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

In [23]:
data = {'state': ['Ujjain', 'Ujjain', 'Ujjain', 'Prayag', 'Prayag', 'Prayag'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [24]:
type(data)

dict

In [25]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0  Ujjain  2000  1.5
1  Ujjain  2001  1.7
2  Ujjain  2002  3.6
3  Prayag  2001  2.4
4  Prayag  2002  2.9
5  Prayag  2003  3.2

In [26]:
frame.dtypes

state     object
year       int64
pop      float64
dtype: object

In [27]:
type(frame)

pandas.core.frame.DataFrame

In [28]:
data['state']
# select state from data;

['Ujjain', 'Ujjain', 'Ujjain', 'Prayag', 'Prayag', 'Prayag']

In [29]:
frame['state']
#Series

0    Ujjain
1    Ujjain
2    Ujjain
3    Prayag
4    Prayag
5    Prayag
Name: state, dtype: object

In [31]:
frame[['state']]
#df
# select state from frame;

    state
0  Ujjain
1  Ujjain
2  Ujjain
3  Prayag
4  Prayag
5  Prayag

In [32]:
type(data)

dict

In [33]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [37]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])
# only a few columns from dict

   year   state  pop
0  2000  Ujjain  1.5
1  2001  Ujjain  1.7
2  2002  Ujjain  3.6
3  2001  Prayag  2.4
4  2002  Prayag  2.9
5  2003  Prayag  3.2

In [38]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

       year   state  pop debt
one    2000  Ujjain  1.5  NaN
two    2001  Ujjain  1.7  NaN
three  2002  Ujjain  3.6  NaN
four   2001  Prayag  2.4  NaN
five   2002  Prayag  2.9  NaN
six    2003  Prayag  3.2  NaN

In [39]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
frame2[['state']]

        state
one    Ujjain
two    Ujjain
three  Ujjain
four   Prayag
five   Prayag
six    Prayag

In [41]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [42]:
frame2['debt']  = 16.5

In [43]:
frame2

       year   state  pop  debt
one    2000  Ujjain  1.5  16.5
two    2001  Ujjain  1.7  16.5
three  2002  Ujjain  3.6  16.5
four   2001  Prayag  2.4  16.5
five   2002  Prayag  2.9  16.5
six    2003  Prayag  3.2  16.5

In [45]:
pd.DataFrame(frame2.debt)

       debt
one    16.5
two    16.5
three  16.5
four   16.5
five   16.5
six    16.5

In [46]:
frame2[['debt']]

       debt
one    16.5
two    16.5
three  16.5
four   16.5
five   16.5
six    16.5

In [49]:
frame2.loc[['three']]

       year   state  pop  debt
three  2002  Ujjain  3.6  16.5

In [50]:
frame2.iloc[[2]]

       year   state  pop  debt
three  2002  Ujjain  3.6  16.5

In [53]:
frame2['debt'] = np.arange(6)
frame2

       year   state  pop  debt
one    2000  Ujjain  1.5     0
two    2001  Ujjain  1.7     1
three  2002  Ujjain  3.6     2
four   2001  Prayag  2.4     3
five   2002  Prayag  2.9     4
six    2003  Prayag  3.2     5

In [52]:
np.arange(6)

array([0, 1, 2, 3, 4, 5])

In [55]:
frame.T.T
#Tranpose

    state  year  pop
0  Ujjain  2000  1.5
1  Ujjain  2001  1.7
2  Ujjain  2002  3.6
3  Prayag  2001  2.4
4  Prayag  2002  2.9
5  Prayag  2003  3.2

In [59]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ujjain', 'Kashi', 'Prayag'])
frame

   Ujjain  Kashi  Prayag
a       0      1       2
c       3      4       5
d       6      7       8

In [60]:
np.arange(9).reshape((3, 3))

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [61]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ujjain  Kashi  Prayag
a     0.0    1.0     2.0
b     NaN    NaN     NaN
c     3.0    4.0     5.0
d     6.0    7.0     8.0

In [62]:
states = ['Ujjain', 'Kashi', 'Mathura']

In [63]:
frame.reindex(columns=states)

   Ujjain  Kashi  Mathura
a       0      1      NaN
c       3      4      NaN
d       6      7      NaN

In [64]:
frame.loc[['a', 'b', 'c', 'd'], states]

/home/nbuser/anaconda3_501/lib/python3.6/site-packages/ipykernel/__main__.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  if __name__ == '__main__':

   Ujjain  Kashi  Mathura
a     0.0    1.0      NaN
b     NaN    NaN      NaN
c     3.0    4.0      NaN
d     6.0    7.0      NaN

In [67]:
frame.iloc[[0,1,2], [0,1,2]]

   Ujjain  Kashi  Prayag
a       0      1       2
c       3      4       5
d       6      7       8

In [69]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ujjain', 'Kashi', 'Prayag', 'Rameshwar'],
                    columns=['one', 'two', 'three', 'four'])
data

           one  two  three  four
Ujjain       0    1      2     3
Kashi        4    5      6     7
Prayag       8    9     10    11
Rameshwar   12   13     14    15

In [71]:
np.arange(16).reshape((4, 4))

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [73]:
data

           one  two  three  four
Ujjain       0    1      2     3
Kashi        4    5      6     7
Prayag       8    9     10    11
Rameshwar   12   13     14    15

In [74]:
data[data['three'] > 5]
# select * from data where three > 5;

           one  two  three  four
Kashi        4    5      6     7
Prayag       8    9     10    11
Rameshwar   12   13     14    15

In [75]:
data[ data < 5]

           one  two  three  four
Ujjain     0.0  1.0    2.0   3.0
Kashi      4.0  NaN    NaN   NaN
Prayag     NaN  NaN    NaN   NaN
Rameshwar  NaN  NaN    NaN   NaN

In [76]:
data['three'] > 5

Ujjain       False
Kashi         True
Prayag        True
Rameshwar     True
Name: three, dtype: bool

In [77]:
data>5

             one    two  three   four
Ujjain     False  False  False  False
Kashi      False  False   True   True
Prayag      True   True   True   True
Rameshwar   True   True   True   True

In [78]:
data.iloc[:3, :3]

        one  two  three
Ujjain    0    1      2
Kashi     4    5      6
Prayag    8    9     10

In [79]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [81]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [83]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [80]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [84]:
frame.apply(lambda x: x.max(), axis =1)

a    2
c    5
d    8
dtype: int64

In [85]:
frame

   Ujjain  Kashi  Prayag
a       0      1       2
c       3      4       5
d       6      7       8

In [86]:
frame.apply(lambda x: x.max(), axis =0)

Ujjain    6
Kashi     7
Prayag    8
dtype: int64

In [87]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [89]:
df.sum(axis =1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [90]:
pd.DataFrame(df.sum(axis =1))

      0
a  1.40
b  2.60
c  0.00
d -0.55

In [91]:
df['sumax'] = df.sum(axis='columns')
df

    one  two  sumax
a  1.40  NaN   1.40
b  7.10 -4.5   2.60
c   NaN  NaN   0.00
d  0.75 -1.3  -0.55

In [92]:
df['sumax'] = df.sum(axis=1)
df

    one  two  sumax
a  1.40  NaN    2.8
b  7.10 -4.5    5.2
c   NaN  NaN    0.0
d  0.75 -1.3   -1.1

In [93]:
df.describe()

            one       two     sumax
count  3.000000  2.000000  4.000000
mean   3.083333 -2.900000  1.725000
std    3.493685  2.262742  2.839454
min    0.750000 -4.500000 -1.100000
25%    1.075000 -3.700000 -0.275000
50%    1.400000 -2.900000  1.400000
75%    4.250000 -2.100000  3.400000
max    7.100000 -1.300000  5.200000